[
{"title": "2 officers among 7 soldiers martyred in terrorist attack on post in North Waziristan: ISPR", "url": "https://www.dawn.com/news/1821887/2-officers-among-7-soldiers-martyred-in-terrorist-attack-on-post-in-north-waziristan-ispr", "text": "Seven soldiers — including two officers — were martyred in a terrorist attack on a security forces’ post in the Mir Ali area of North Waziristan district, the Inter-Services Public Relations (ISPR) said on Saturday.Six terrorists were also neutralised in the subsequent clearance operation.According to the military’s media affairs wing, in the early hours of March 16, 2024, a group of six terrorists attacked a security forces’ post in the general area of Mir Ali of North Waziristan District.“As own troops foiled the initial attempt of intrusion, the terrorists rammed an explosives-laden vehicle into the post, followed by multiple suicide bombing attacks, which led to the collapse of a portion of a building, resulting into  (martyrdom) of five brave sons of the soil,” ISPR added.The martyrs of the initial attack include Havildar Sabir, a resident of District Khyber, Naik Khurshid  (resident of District Lakki Marwat), Sepoy Nasir (resident of District Peshawar), Sepoy Raja (resident of District Kohat) and Sepoy Sajjad (resident of District Abbottabad).“During the conduct of the ensuing clearance operation, own troops led by Lieutenant Colonel Kashif, effectively engaged and killed all six terrorists,” ISPR said.“However, during the intense exchange of fire, leading his troops from the front, Lieutenant Colonel Syed Kashif Ali (age: 39 years, resident of Karachi) and Captain Muhammad Ahmed Badar (age: 23 years, resident of District Talagang), having fought gallantly, paid the ultimate sacrifice and embraced ,” ISPR added.The military’s media wing said a sanitisation operation was being conducted to eliminate any other terrorist present in the area, “as security forces of Pakistan are determined to wipe out the menace of terrorism from the country and such sacrifices of our brave soldiers further strengthen our resolve”.The funeral of the martyrs was later held at Bannu Cantt.“The martyrs will be buried in their native areas with full military honours. However, a large number of military and civil officials, including General Officer Commanding Major General Anjum Riaz attended the funeral prayers,” the ISPR said.“Pakistan Army will continue to render sacrifices till the last drop of blood for the defence of the dear motherland,” the ISPR added.    Prime Minister Shehbaz Sharif and President Asif Ali Zardari, in separate statements, condemned the attack.The prime minister called the attack a “coward” move by the terrorists.“The security forces have foiled the sinister designs of the terrorists,” PM Sharif said, according to the prime minister’s office.“I, and the whole nation, are proud of the martyrs who sacrificed lives,” he said.He prayed for the departed souls and offered condolences to the bereaved families.President Zardari condemned the terrorist attack and extended condolences to the bereaved families.In a post on X, the head of state paid tribute to army officers and soldiers who embraced martyrdom in the attack. He also expressed the nation’s commitment to completely eradicate terrorism.The president prayed to elevate the rank of martyrs and give patience to their families.    Foreign Minister Ishaq Dar said the nation was united in combatting terrorism in all its forms.    National Assembly Speaker Sardar Ayaz Sadiq also condemned the attack.According to a post on X by the National Assembly’s official account, the speaker expressed deep sorrow and regret over the loss of precious lives, and paid tribute to the martyrs including Lt Col Kashif and Captain Ahmed.“The nation will never forget the sacrifices of its soldiers,” the statement quoted the National Assembly speaker as saying. “Terrorists are following the nefarious intentions of the enemy in which they will never succeed.”The speaker said that the entire nation was standing together with the security forces to crush the nefarious intentions of terrorists.    Pakistan has witnessed an uptick in terror activities in 2023 year, especially in KP and Balochistan after the banned militant Tehreek-i-Taliban Pakistan  with the government in November 2022.The ISPR said earlier this month 10 militants were killed in  by security forces in the North Waziristan district. It added that Pakistan expected the Afghan government to fulfil its obligations and deny the use of Afghan soil by terrorists.Last month, a late-night attack on a police station in Dera Ismail Khan was . Gunmen had mounted an attack using heavy weapons but fled in the cover of darkness when police personnel fired back.In December last year, 23 soldiers were  and more than 30 troops wounded after militants belonging to the Tehreek-i-Jihad Pakistan (TJP) stormed a compound used by the military in Dera Ismail Khan’s Daraban area.According to an annual security  issued by the Centre for Research and Security Studies, Pakistan witnessed 1,524 violence-related fatalities and 1,463 injuries from 789 terror attacks and counter-terror operations in 2023 — marking a record six-year high.KP and Balochistan were the primary centres of violence, accounting for over 90 per cent of all fatalities and 84pc of attacks, including incidents of terrorism and security forces operations.Dear visitor, the comments section is undergoing an overhaul and will return soon."},
{"title": "Pre-arrest bail of Imran, SIC chief extended in May 9 cases\n", "url": "https://www.dawn.com/news/1821733/pre-arrest-bail-of-imran-sic-chief-extended-in-may-9-cases", "text": "LAHORE/TOBA TEK SINGH: An anti-terrorism court on Friday extended the pre-arrest bail of jailed PTI founder Imran Khan in three cases of  riots.ATC-III judge Arshad Javed heard the bail petitions as a duty judge as the presiding judge of ATC-I, the relevant court, had been transferred.The judge simply adjourned the hearing till March 22 and also extended the bail of the former premier in cases of attacks on Jinnah House, Askari Tower and Shadman police station.The judge on March 1 confirmed the pre-arrest bail of Khan in four cases, including murder of Zille Shah, attack on police outside Zaman Park, and torching offices of PML-N in Model Town and a container at Kalma Chowk on May 9 last.An ATC on Aug 11, 2023, dismissed the pre-arrest bails of the PTI founding chairman over his non-appearance as he was jailed following his conviction in the Toshakhana case.Later, the Lahore High Court, on a petition by Khan, set aside the decision of the ATC and restored his bail petitions. The high court also directed the trial court to decide the bail petitions afresh on merit.Meanwhile, Faisalabad anti-terrorism court judge Muhammad Hussain extended the bail before arrest of Sunni Ittehad Council (SIC) Chairman and MNA Sahibzada Hamid Raza, his brother Sahibzada Hassan Raza, his sister and 17 PTI activists till the next hearing in the May 9 case.The accused were charged with attacking and ransacking the ISI office in Faisalabad after the arrest of Imran Khan.The prosecution informed the court the joint investigation team had not completed the investigation into the case yet. The court directed the prosecutor to ask the JIT to complete the investigation at the earliest.Besides Raza, his brother and sister, those who appeared before the court included two MNAs Malik Umer Farooq and Rai Haider Kharal and three MPAs Hasan Zaka Niazi, Khayal Ahmad Kastro and Asad Mahmood.Dear visitor, the comments section is undergoing an overhaul and will return soon."},
{"title": "Editorial: New govt must focus on real reforms, not antiquated ideas, to alleviate poverty", "url": "https://www.dawn.com/news/1821846", "text": "PAKISTAN’S politicians and policymakers must evaluate economic models that yield better results than the old five-year plans. Instead, just like its predecessor, the Shehbaz Sharif government is drafting a five-year  outlining the way to economic resurgence and stability. The ultimate aim is to curb inflation, alleviate poverty and create jobs. A committee has been formed to consult the relevant ministries to set targets for the next five years in different sectors. Once the required information is gathered, the economics planners intend to roll out a “consolidated document” that includes five-year targets for a number of sectors such as energy, agriculture, SMEs, exports, taxation, IT, investment and privatisation.A key component of economic strategy in the 1960s and 1970s in many countries, five-year plans lost their utility in the free market system that consolidated its global hold following the fall of the Soviet Union.Countries are drifting away from such planning models. In recent years, for example, this model has made way for a three-year action plan as part of India’s 15-year vision document. Other economies have also replaced this document with similar rolling, strategic economic models, which are flexible and in sync with today’s realities. Five-year plans are a legacy of highly centralised economic systems where governments used to shape their growth by controlling economic activities through permits, licences, voucher schemes, nationalisation, credit allocations, etc.In the modern world, where the private sector is considered the engine of economic growth and development, such government intervention in the economy creates distortions and impedes growth. Pakistan is a major example of why a government should not be involved in economic activities.In the light of past experience, it is advisable that the government evolve a well thought-out strategy to reduce its footprint on the economy, encourage market forces, and help the private sector realise its full potential. The sole objective of the government’s development vision should be to evolve sound policies for private investors for a period of, say, 20 years, decentralise the power structure for quick decision-making, and regulate the markets justly to protect consumers. This paradigm shift in planning is not only needed to fix the economy but is also in keeping with the sociopolitical changes in Pakistan.Centralised planning hasn’t worked here beyond a certain point. It is hard to recall if any five-year plan has achieved its goals. Even the much-touted early plans implemented under the Ayub regime in the 1960s produced only business monopolies, and an oligarchy that thrived on the state’s largesse.It would be much better for the new government to focus on real reforms and formulation of policies needed to pull the country out of poverty rather than waste its energy and resources on antiquated ideas.Dear visitor, the comments section is undergoing an overhaul and will return soon."},
{"title": "Elections have brought about a new balance of power between ‘veto player’ and political party", "url": "https://www.dawn.com/news/1821843", "text": "ONE of the first concepts in undergraduate economics textbooks is the distinction between positive and normative analysis. A positive analysis describes the world objectively, or as it is empirically observed, while normative analyses focus on subjective value judgements, or how the world ought to be.The electoral outcomes of Pakistan’s recent elections will have a tremendous bearing on the country’s political and economic future. Predict­ably, many analyses have been released on the future course of Pakistan’s politics and economy. But, somehow, most of these analyses were either knee-jerk reactions or clouded by the analyst’s normative bias.What follows is a ‘positive’ analysis of Pakistan’s political system, as it only describes what is observed and, based on these empirical observations, what is likely to happen in the future. At no point should this analysis be taken as a position for how things ought to be. This is a very important point.A great majority of recent analyses seem to take the position that, given post-election reality, volatility in Pakistan’s political and economic system will only increase, leading to, according to some analyses, a complete inversion of the system. What the analyses are hinting at is that this government will not be able to get its sea legs, and, sooner rather than later, Pakistan’s political system will sink into such bewildering chaos that it will also take down Pakistan’s democracy and its economy with it.There will still be skirmishes but neither player will venture towards disturbing the new equilibrium.It is true that a political system’s volatility always impacts economic sentiments, which, in turn, can have disastrous consequences for economies. In the midst of a political crisis, fearing the worst, people may decide to sit on their liquid cash, thereby drying up all demand in the economy. It goes without saying that such sudden evaporation of demand from an economy will invariably have a significant negative impact on economic growth and job creation.Be that as it may, the structural characteristics of Pakistan’s political system are such that doomsday scenarios usually do not come to pass. The main reason behind this is the disproportionate amount of power that resides with the system’s ‘veto player’, which often works as an off-switch — or a circuit breaker, if you will — whenever the political system starts vibrating uncontrollably.Still, the results of the recent elections in Pakistan have forced everyone to sit up and take notice, as a political party has  than all others despite significant constraints. These unexpected results and the ensuing aggressive strategy employed by the party has thus convinced most analysts that the present government will neither survive nor be able to stabilise the economy.Where analysts have a right to proffer their assessment, it is probably optimal to analyse the present political situation in Pakistan in light of the stability-instability paradox — an international relations theory regarding the effects of nuclear weapons. This theory came on the scene in the early days of the Cold War. The stability-instability paradox has wide currency, and international relations scholars are virtually unanimous in their belief that the paradox largely explains the conflict in nuclear South Asia.Specifically, the stability-instability paradox is used to better understand how the introduction of nuclear weapons impacts relations between two adversaries. The paradox reveals that where the possession of nuclear weapons lends a certain strategic stability, given the exorbitant costs of nuclear conflict, these arms also inject tactical instability, meaning that short of breaching each other’s red lines, both adversaries are more likely to engage in low-intensity localised conflict with each other. The late Prof Kenneth Waltz, a leading international relations scholar, argued that the presence of nuclear weapons actually tempts nuclear-armed neighbours to fight ‘small wars’.To be sure, analysts are correct in ascribing significance to the results of the recent elections in Pakistan. But, these results have only brought about a new balance of power, or an equilibrium, between the veto player and the political party, especially as the pendulum seemed to have swung too far in one direction.In essence, both players have now demonstrated their capabilities, thereby imposing a stability-instability paradox on the political system. In a sense, red lines have been re-identified, boundaries have been redrawn, and spheres of influence re-demarcated. Under this strategic ‘stability’, there will still be skirmishes, but neither player will venture towards disturbing the new equilibrium. In other words, the skewed distribution of power in the Pakistani political system remains intact, and for this reason, where there may be social unrest, there is a very high probability that this government will stay in place unless acted upon by an exogenous force.What this situation also points out is that under the veto player’s not-so-invisible hand, the new government will be successful in not only completing the present programme, but also in signing on the dotted line with the IMF for a new programme. Both programmes will go a long way in providing much-needed stabilisation to the economy.All said and done, there is perhaps some efficacy of having an off-switch in the political system. But, the larger — and normative — question is about its control. Who controls the switch, why and how? In order to address this normative question, there is a need to first focus on the lopsided nature of power distribution in the political system.To this end, all stakeholders, adversaries and players will have to sit across the table from each other to restructure the characteristics of this political system. There are multiple routes available for the willing. One route goes by way of Turkiye, while the other goes by way of Indonesia.But, at least in the short to the medium term, it appears that the dynamic equilibrium described by the stability-instability paradox will dominate in Pakistan’s political system.Dear visitor, the comments section is undergoing an overhaul and will return soon."},
{"title": "Political engineering has its limits; it is imperative to reset the entire system", "url": "https://www.dawn.com/news/1821842", "text": "AS the dust settles and the politicians assume office, it is time to take a dispassionate look at the emerging dispensation, with a particular focus on the four principal players: the PTI, PPP, PML-N, and the establishment. They will have a defining role to play — individually, collusively, or collectively — in the coming months; either to initiate the much-needed stability and economic revival, or push the country further into the abyss of chaos and disorder.PTI: At the outset, let it be said that even if the elections were rigged, the ‘plan’ has not fully produced the desired results. Perhaps, the game of asserting authority has reached its tragic limits. First, in the last set-up, the PML-N was ousted from the federal and provincial governments, and the PPP reduced to the rural areas of Sindh. But this time, an embattled PTI has retained a majority government in KP.Second, the PTI’s sizeable presence on the opposition benches in Punjab and the federal legislatures will enhance its bargaining power vis-à-vis the establishment, particularly in reference to the tough policy decisions that are to be taken by the PML-N coalition government in the face of a substantial public backlash.Third, the resurgence of an underdog PTI facing down powerful opponents has also helped the party and its followers cross the psychological barriers of fear and vulnerability.A formidable PTI-led opposition could become a nightmare for the government.Finally, the PTI is better placed to rope in religious and nationalist parties, which nurse their own grouse against the establishment and the PML-N-PPP duo for ‘stealing’ their seats. Thus, a formidable PTI-led opposition in and out of parliament could become a living nightmare for the government; more so, if an estranged Maulana Fazlur Rahman of the JUI-F were to join it with his numerous street-fighting cadres.PPP: These elections have been a godsend for the PPP. It has emerged as a new balancing force, relegating the once redoubtable PML-N to a lesser position. It has formed a solid majority government in Sindh, where it already enjoys an absolute hold over local governments, including in Karachi, whose mayor is from its own ranks. The PML-N-led minority federal government will also subsist at its pleasure. It has already occupied the presidency, and is tipped to have the office of chairman Senate, besides possessing the ‘right’ to appoint governors in two key provinces, Punjab and KP, by virtue of an ‘agreement’ with the PML-N.More surprisingly, it has formed a coalition government in Balochistan, where its presence is thin. No wonder pundits view President Asif Ali Zardari as the emerging kingmaker. But the PPP’s meteoric rise also raises questions: how did it achieve such success? Was it due to its ‘performance’ in Sindh and elsewhere? Or a reward for its 15-year-long, testy but trusted ‘engagement’ with the powers that be? Or was it the triumph of the skills of its co-chairman (Zardari) to game the system? A separate piece would be needed to attempt the answers.PML-N: The PML-N is facing its moment of truth. It is a victim of its own doings and responsible for the Phoenix-like rise of its arch-rival PTI. The edifice of its duality, carefully nurtured over the years by Nawaz Sharif’s anti-establishment narrative and the can-do image of Shehbaz Sharif, now lies in tatters, thanks to its alliance with its old nemesis — ie, the establishment — and the poor performance of the PML-N-led PDM government. On top of that, it is saddled with steering the country out of multiple crises on the back of a rickety, hotchpotch government. The ensuing financial constraints, a tough opposition, and the IMF’s implacable conditionalities will further erode its political standing, including among its traditional allies — the industrial and trading classes, which dominate the economic heart of central Punjab.However, the real test of its stewardship would be getting around the IMF for a long-term deal in the tumultuous times that lie ahead. The PTI-led opposition is already baying for its blood. Thus, in the emerging tough scenario, Prime Minister Shehbaz Sharif will have little option but to periodically seek the establishment’s indulgence in carrying out the needed legislative and economic agendas (just as Imran Khan did during his incumbency). But would (or could) the powers that be get him the desired results in such times? The answer requires looking into the establishment’s own predicament.Establishment: The strong-arm methods and alleged ‘institutional’ help in forging an anti-PTI alliance and ‘managing’ electoral results haven’t really borne fruit for certain quarters in cutting the PTI down to size, ensuring political stability and economic revival, and dominating a fractured polity. Instead, the PTI seems to have emerged rather more robustly, electorally and morally. In fact, a hung parliament has enhanced its leverage to play tough and get a better deal from those it sees as holding the reins. So far, Imran Khan has not budged, despite the increasing number of cases against him.The PTI’s letter to the IMF demanding an electoral ‘audit’ has also set the tone, reflecting a no-holds-barred approach. It is, therefore, likely that the party may not only feed into the instability, but try to weaponise it too in its attempt to get the powers that be to give ground or let the system implode. A modus vivendi between the establishment and the PTI has been suggested by some in order to ensure stability, salvage the economy, and possibly realise the former’s inclination for constitutional changes to reverse some key financial and political benefits that accrued to the provinces after the 18th Amendment.Way out: The country is in a deep ditch again. It can no more be lifted via the old ‘managerial ways’ by coercion, allegedly compromised sections of the judiciary, or a legion of turncoats. Political engineering has its limits, and can only improvise ways to prolong its dysfunctionalities, and that too at a heavy cost — political, institutional, economic and human.But as things stand, working a visibly rigged system is going to prove difficult, if not destructive for the institutions. It is, therefore, imperative to reset the entire system, consensually and democratically. Or else the ditch will only deepen.Dear visitor, the comments section is undergoing an overhaul and will return soon."},
{"title": "Interior ministry censured by SHC for not deporting Indian national held 11 years ago\n", "url": "https://www.dawn.com/news/1821789/interior-ministry-censured-by-shc-for-not-deporting-indian-national-held-11-years-ago", "text": "KARACHI: The Sindh High Court on Friday expressed resentment towards the interior ministry for not deporting a detained Indian national despite lapse of around seven years and warned that the interior secretary would be summoned if the deportation was not carried out.  The court observed that the appellant was an Indian national while the ministry could not be able to confirm his nationality apparently due to lack of efforts.  The single-judge bench headed by Justice Mohammad Karim Khan Agha directed the ministry of interior to depute an officer well-versed with the facts of the case or file a compliance report at the next hearing.  Abdul Mughni was arrested in 2013 by the Mobina Town police station near Abul Hassan Ispahani Road and booked him under various provisions of the Foreigners Act.  Abdul Mughni was arrested in 2013 and booked under Foreigners Act A sessions court had sentenced him to six months in prison in 2017. The convict filed an appeal against his conviction before the SHC.  The bench said that since the appellant had already served out his sentence, the jail superintendent had been directed to make arrangements for his deportation through the home department.  However, at the last hearing, it also noted that the focal person of the home department of Sindh had submitted that a correspondence was made with the ministry of interior on the subject matter and it did not respond and thereafter, the court had issued a notice to the secretary to send an official familiar with this case to explain as to why the appellant had not been deported yet.  On Friday, a section officer of the ministry turned up and asserted that the deportation had not been made yet due to certain procedural issues.  The bench in its order said: “I find it quite extraordinary that after a lapse of seven years, ministry of interior has not been able to confirm whether the appellant is an Indian national or not. Prima facie this is because of lack of efforts on the party of ministry of interior”.  The bench stated that when the section officer was confronted, he was not even aware if the Indian government had similar computerised national identify card system like Nadra.  “In the event the impugned order dated 24.08.2017 regarding the deportation of the appellant is not complied with by the next hearing, this court will have no option except to call the secretary, ministry of interior, government of Pakistan in person to explain as to how his department is actually working in such like matters”, it added.  The bench asked its office to send a copy of this order to the interior secretary for information and compliance.  “It is expected that on the next date of hearing, secretary, ministry of interior shall send an officer well-served with the facts of the case or file his compliance report via DAG [deputy attorney general] regarding the deportation of the appellant. In this regard, reasonable time is given and this matter shall come up on 13.05.2024 at 09:00am”, it concluded.Dear visitor, the comments section is undergoing an overhaul and will return soon."},
{"title": "Second polio case in as many days rings alarm bells\n", "url": "https://www.dawn.com/news/1821810/second-polio-case-in-as-many-days-rings-alarm-bells", "text": "ISLAMABAD: The second polio case in as many days has once again raised concerns over the efforts to end the crippling disease from Pakistan.The latest case has been repor­ted from Balochistan’s Chaman district, where a 52-month-old child has been paralysed by the wild poliovirus type 1 (WPV1).According to the Regional Re­­fe­rence Lab for Polio Eradication at the National Institute of Health (NIH), Islamabad, WPV1 was isolated from the child’s stool samples.The isolated virus belongs to the imported YB3A cluster, which has been detected in 10 positive samples reported from Chaman since October 2023.The case surfaced a day after a 30-month-old boy was  to have been paralysed in Dera Bugti. The child had weakness in both his lower limbs, and the isolated virus belongs to the imported YB3A cluster.Pakistan Medical Association calls for filling gaps in immunisation effortsAn NIH lab official said poliovirus is in communities and continues to remain a persistent threat to children across the country since it has been detected in 56 environmental samples of more than 25 districts so far this year and in more than 100 sewage samples last year.“The virus particularly attacks children who are malnourished and have weak immunity because of being under-vaccinated or not vaccinated for polio and other childhood diseases.”The official urged parents, caregivers, religious leaders, teachers and community elders to play their role in countering the disease and ensure that all children under five years of age are during immunisation drives.Since the beginning of 2024, the national polio  has conducted two vaccination drives targeting 45 million children.In response to the new cases, a fresh polio drive will begin on March 25 in districts where the virus has been detected. The drive will target more than six million children.Experts have said the new cases indicated gaps in immunisation efforts and emphasised steps to tackle the disease.“It is disheartening to see the polio cases which indicate the gaps in immunisation efforts and underscores the importance of ensuring that every child receives the polio vaccine,” Pakistan Medical Association (PMA), the representative body of health practitioners, said in a press release.“We urge parents to cooperate with healthcare workers and vaccinate their children,” it said.PMA Secretary General Dr Abdul Ghafoor Shoro said poliovirus is a highly infectious disease that mainly affects children under the age of five.It causes paralysis, permanent disability, and, in severe cases, can be fatal, he added.“Despite substantial progress in the fight against polio, Pakistan remains one of the two countries where the disease is still endemic”.“He said that the recent cases serve as a “wake-up call” for health authorities, healthcare workers, and communities across Pakistan.“The only way to protect children from polio is through vaccination, Dr Shoro said, adding that consistent and widespread immunisation campaigns are “critical to eradicating this disease once and for all”.The PMA emphasised the role of public awareness in addressing vaccine hesitancy and dispelling misconceptions surrounding polio im­­m­unisation, he said. He stressed effo­rts to inform communities about the safety and effectiveness of the vaccine, encouraging them to participate in vaccination campaigns.“Vaccination efforts must be in­­t­e­­nsified while simultaneously en­­s­u­ring the safety of healthcare workers and communities,” Dr Shoro said. “As Pakistan strives to achieve polio eradication, the PMA remains dedicated to supporting governm­ent efforts and collaborating with all stakeholders to protect children from this debilitating disease.”Dear visitor, the comments section is undergoing an overhaul and will return soon."},
{"title": "DSP, tribal elder killed in Sibi, Bajaur attacks\n", "url": "https://www.dawn.com/news/1821752/dsp-tribal-elder-killed-in-sibi-bajaur-attacks", "text": "QUETTA / BAJAUR: A senior police officer and a tribal elder were killed in two attacks in Sibi and Bajaur on Friday, according to officials.Sibi Deputy Superintendent of Police (DSP) Khalid Zaman Marri was passing through the bazaar area in Sibi town when unknown assailants opened fire at his vehicle near the Chanak roundabout area.The police officer got critically injured after receiving six bullets and was taken to the Combined Military Hospital. He later succumbed to his injuries.One of the attackers was injured after the DSP’s security guard returned fire. He, along with other attackers, managed to flee but was caught by the police near Nishtar Road and shifted to the hospital.Police officials said the motive behind the attack couldn’t be ascertained immediately, and no group has claimed responsibility.“We are investigating the attack from all aspects,” Sibi SSP Inayatullah Bangulzai said.Three alleged militants gunned down in Lakki MarwatA senior police officer said DSP Marri had served as SP Counter Terrorism Department (CTD) in Sibi.The victim was the elder brother of Mir Asghar Marri, who was the former district mayor of Sibi.In Bajaur, a tribal elder was killed in a remote-controlled bomb explosion in the mountainous area of Barang tehsil.According to locals and police, the attack occurred in the Asil Targaoo locality at about 9:25am. The target was a tribal elder, Malik Lal Zareef.The explosive device planted along the road went off when Mr Zareef, who was on foot, reached the spot.They said that the 55-year-old victim was critically wounded and died before he could be moved to a hospital.Police have confirmed the explosion and said an investigation has been launched to arrest the culprits. No group has so far claimed responsibility for the attack.A senior police official told  that a team from the Barang police station has launched a search operation, but no arrests have been made so far.The official added that police personnel have collected evidence from the crime scene.Separately, three alleged militants were killed in an intelligence-based operation in Lakki Marwat, officials said on Friday.A district police official said that the CTD and security forces conducted a joint operation in a rural area of Lakki Marwat on the information about militants’ presence.“An intense fire exchange took place between security personnel and the militants,” the official said, adding that three alleged militants were gunned down.They have been identified as Zubair, a local militant commander; Faisal; and Jawad.They belonged to the Abdulkhel and Nawerkhel areas and were allegedly affiliated with the outlawed Tehreek-i-Taliban Pakistan.According to the officials, the militants were involved in attacks on police and security forces, target killings and extortion. Ammunition and explosives were also recovered from their possession.Following the gunfight, reinforcements arrived in the area, and a search was launched to capture the fleeing militants.The militants’ presence in several rural localities, including the mountainous areas of Abdulkhel and Shah Hasankhel, is considered a constant threat to peace in the southern district of Khyber Pakhtunkhwa.Dear visitor, the comments section is undergoing an overhaul and will return soon."},
{"title": "Govt accuses PTI of ‘sabotaging’ deal with IMF\n", "url": "https://www.dawn.com/news/1821812/govt-accuses-pti-of-sabotaging-deal-with-imf", "text": "WASHINGTON / ISLA­M­ABAD: Minister for In­­formation and Broad­cast­ing Ataullah Tarar said on Friday that a handful of “miscreants” associated with the PTI were bent upon sabotaging Pakis­tan’s deal with the IMF, which he said was crucial for economic stability.His remarks follow IMF’s refusal to accept a letter from the PTI during a protest outside the Fu­­nd’s Washington offices, where officials asked demonstrators to submit the letter via email instead. The letter urged IMF Managing Director Kris­talina Georgieva to “withhold any further financial assistance or loan disbursements to Pakistan until a credible investigation by an independent body” clears it of all rigging allegations.Although organised by a human rights group called First Pakistan Global, the majority of protesters gathered outside the IMF headquarters were PTI supporters.  Party protests outside lender’s offices; Fund officials refuse to accept letter in personA truck displaying messages about rigging on four large screens also dr­­ove around the IMF headquarters and downtown Wash­ington during the protest.The PTI supporters interacted with IMF officials exiting the building, handing pamphlets to them, and explaining the situation to those interested in learning more. Dr Shahbaz Gill, Imran Khan’s former chief of staff, stated in his speech that the IMF’s mandate re­­­quires it to promote democracy and good governance. He criticised the IMF for cooperating with the establishment that he alleged was installing puppets, only to discard them when convenient. He emphasised that PTI was not preventing the IMF from assisting Pakist­­an, but urged them to en­­g­age with elected represen­tatives to ensure responsible use of funds by the government. Sajjad Barki, a senior PTI leader from Texas, recalled that before signing the last agreement, an IMF representative visited Pakistan and met with Imran Khan and other stakeholders.  “They spoke about promoting democracy in Pak­istan and ensuring free and fair elections. So, PTI agreed to respect the pac­kage. We kept our pledge, now it’s the IMF’s turn to fulfil its promise,” he said. Addressing a news conference in Islamabad on Friday, Mr Tarar said that at the protest, activists belonging to PTI were urging the IMF to give funds to Pakistan only if their jailed leader was released, regretting that activists of an “anti-national” party continued to hold sit-in and protest outside the IMF offices.He said the protesters only wanted to sabotage the IMF deal because their dream was to make Pakistan default. But Pakistan would progress and the growth rate would increase soon, he said. He advised the PTI to approa­­ch courts to secure Imran Khan’s release as the IMF and World Bank had nothing to do with his cases. “We have been voted [in] by the people to solve the problems of the country, not to increase them,” he maintained.He said under the vision of the prime minister efforts would be made for making the country prosperous through hard work.In reply to a question, the minister said that PTI would be requested to re­­frain from taking any such initiatives that undermi­ned the country’s economy.Dear visitor, the comments section is undergoing an overhaul and will return soon."},
{"title": "NFC award: CM Shah says Constitution doesn’t allow reduction in provincial share", "url": "https://www.dawn.com/news/1821891/nfc-award-cm-shah-says-constitution-doesnt-allow-reduction-in-provincial-share", "text": "Sindh Chief Minister Syed Murad Ali Shah on Saturday said the Constitution did not allow a reduction in the share of provinces in the National Finance Commission (NFC) award amid reports that the International Monetary Fund (IMF) was seeking a reassessment of the award.Under the 7th NFC Award, the share of provinces in vertical distribution was increased from 49 per cent to 56pc during 2010-11 and 57.5pc during the remaining years of the award.The traditional population-based criteria for the horizontal distribution of resources amongst the provinces was changed to a multiple-criteria formula. According to this criteria, 82pc distribution was made on population, 10.3pc on poverty and backwardness, 5pc revenue collection/generation, and 2.7pc on inverse population density.Recently, there have been  of the IMF asking Pakistan to reopen discussions on the NFC award, seeking to address the ongoing imbalance in the distribution of fiscal resources between federal and provincial governments.The IMF reportedly emphasised the need to reassess the NFC award, citing disparities in resource allocation betw­een federal and provincial authorities.Addressing the matter while talking to the media in Karachi today, Sindh CM Shah said the government could not reduce the allocation to the provinces in the NFC award due to IMF pressure. “It is written in the Constitution about the NFC award that the share of the provinces [in resources] cannot be reduced [but] it can be increased,” he added.Shah said the government must have likely intimated the IMF about this, adding that he was not even sure if the reduction was a condition in the IMF talks or not since he was not part of them.The chief minister said provinces were given additional responsibilities after the 18th Amendment and, thus, the NFC award should be changed accordingly to reflect them instead of continuing the 7th NFC Award.He reiterated that it was the PPP and Sindh government’s demand from the federal government to bring in a new NFC award since the old no longer applied after the 18th Amendment.    Article 160 of the Constitution governs the NFC award. Section 3A of the article says: “The share of the provinces in each award of National Finance Commission shall not be less than the share given to the provinces in the previous award.”In July 2020, the then-opposition had  to amend the constitutional provision barring any reduction in the previous year’s share of the provinces in the NFC award, following a heated debate on the issue.The house by a 25-17 majority vote had disallowed leave to introduce a bill seeking to amend Article 160 (3A) of the Constitution to Barrister Muhammad Ali Saif of the Muttahida Qaumi Movement-Pakistan.Dear visitor, the comments section is undergoing an overhaul and will return soon."},
{"title": "PM vows to meet army’s needs, seeks US support for economy\n", "url": "https://www.dawn.com/news/1821751/pm-vows-to-meet-armys-needs-seeks-us-support-for-economy", "text": "    ISLAMABAD: Prime Minister Shehbaz Sharif on Friday committed to fulfilling the military’s resource requirements, as he sought US support for economic reforms and a new International Mone­tary Fund (IMF) programme.“Government shall provide all the resources required for ensuring operational readiness of the Armed Forces,” PM Shehbaz said during his first visit to the General Headquarters after assu­ming office, where he was accompanied by some of his key ministers.The prime minister was given a security briefing during his visit, which covered the threat spectrum, response to the security threats and ongoing counterterrorism operations.“During the visit, Prime Minister and Cabinet members engaged in discussions with military leadership on matters of nati­onal security, regional stability and military preparedness,” a statement relea­sed by the PM Office said.The official press release did not explicitly state whether the economic crisis was discussed, except for making public the PM’s assurance on fulfilling the requirements related to operational readiness. This implied that while the government may cut some of its expenditures as part of its belt-tightening, defence spending would remain unaffected.PM Shehbaz said that Pakistan was destined to rise and the armed forces had a crucial role in ensuring the peaceful rise of the country.“PM and cabinet members appreciated the professionalism, operational readiness, and sacrifices of Pakistan Army in war against terrorism and commended the dedication of the Pakistan Army in safeguarding the nation’s territorial integrity and ensuring peace and stability,” the statement said.According to the statement, Army Chief Gen Asim Munir affirmed that Pakistan Army will live up to the nation’s expectations and will resolutely support the government in addressing the security challenges facing the country.Earlier on Friday, the PM met with the US ambassador to pinpoint areas of cooperation, including Islamabad’s engagement with the IMF.According to the US Embassy in Islamabad, “US support for continued economic reforms with and through the IMF” was among the key areas of bilateral cooperation discussed during a meeting between Prime Minister Shehbaz Sharif and US envoy Donald Blome — the first since Mr Sharif assumed office for the second time.The meeting occurred a day after the commencement of discussions between Pakistan and the IMF for the second  of the Stand-By Arrangement.Although a new programme is not on the agenda of the ongoing meeting, the new finance minister Muhammad Aurangzeb has already hinted that Pakistan would advocate for a larger, long-term programme during the review.The discussions with the IMF for the release of the last tranche under the SBA will continue until Monday (March 18).During his meeting with Ambassador Blome, PM Shehbaz stated that his government would focus on macro-economic reforms to stabilise the economy and attract foreign investment.He highlighted the role of the Special Investment Facilitation Council (SIFC), established to expedite foreign investments in the country’s priority sectors.Other areas of cooperation discussed during the Shehbaz-Blome meeting included regional security, trade and investment, education, climate change, and private sector-led economic growth.The prime minister called for regularly convening existing dialogue mech­anisms on areas of cooperation, particularly trade, investment, energy, health, defense, education, agriculture, and climate change.The envoy noted that the US considered Pakistan an important partner and hoped for stronger ties.The US embassy said that Ambassador Blome “expr­essed US support for Pak­is­tan’s democracy and the role of an independent press”.Separately, PM Shehbaz launched a countrywide spring  drive and urged the nation to vehemently take part in the campaign.The PM kicked off the drive on Friday by planting a sapling in the Prime Minister House’s lawn.Reiterating the government’s resolve to increase the green cover, the PM announced doubling the number of saplings planted in 2024 compared to the previous year’s target.PM Shehbaz highlighted the urgency of expanding the forest cover from five per cent of the total area to mitigate the impact of climate change.The prime minister directed the authorities concerned to make all possible efforts to expand the plantation drive to every corner to make Pakistan “green and pollution-free”.He also asked the citizens to help the government by participating in the drive.Dear visitor, the comments section is undergoing an overhaul and will return soon."},
{"title": "IMF-directed ordinances spark ‘betrayal’ cries in NA\n", "url": "https://www.dawn.com/news/1821753/imf-directed-ordinances-spark-betrayal-cries-in-na", "text": "• Govt lays seven controversial ordinances amid opposition by PTI and JUI-F\n• PPP initially opposes move, but votes in favour of government\n• Five women MNAs take oath after PHC decision on reserved seats\n• House passes resolution to condemn Israeli aggression against PalestiniansISLAMABAD: Accusations of betrayal flew back and forth in the National Assembly on Friday as the government laid seven IMF-directed controversial ordinances before the house and then sought approval of their extension for another four months amid strong protest by the opposition PTI and even the government’s key ally PPP.When PTI’s Omar Ayub Khan asked the chair to take a picture of those members “who are selling Pakistan” by supporting these ordinances, Law Minister Azam Nazeer Tarar responded immediately and dubbed the PTI members “traitors and anti-state” for  to the International Monetary Fund (IMF) and the European Union.Though PPP members initially opposed the government’s move to table the ordinances that the caretaker government had promulgated in line with IMF conditions, they later voted in favour of the government when Speaker Ayaz Sadiq put the motion for a vote after the opposition challenged his ruling on the voice vote.The speaker allowed the law minister to lay the resolution after the house approved the motion seeking suspension of the rules to do so with a 130-63 vote. The JUI-F also opposed the government’s move to table the ordinances “under the IMF pressure”, but its members abstained from voting on the motion.Interestingly, the first opposition to the ordinances came from the PPP, when its MNA from Karachi, Abdul Qadir Patel, questioned the haste the government showed in bringing the ordinances without giving the members a three-day notice as required under the rules.Mr Patel alleged that the caretaker government had promulgated the ordinances while exceeding its mandate. He asked the speaker to follow the Sindh model and constitute a committee to review the caretaker government’s decisions.Instead of the government, Speaker Sadiq himself responded to Mr Patel’s objections, stating that these ordinances were linked to the “IMF-related issues” and, if not taken up timely “, Pakistan can face a loss”.The speaker declared that the ordinances were being tabled in the form of bills and that he would refer them to the committees where the members would get an opportunity to debate them.Another PPP MNA, Syed Naveed Qamar, also expressed “serious reservations” not over the way the government brought them before the house but also stated that his party had reservations over the contents of these ordinances.Mr Qamar said they had voted in favour of the government being part of the ruling coalition, but asked the chair to rule that these laws would not be implemented until they were approved by the house and its committees. He asked the government to better “wind up” the house if it wanted to run the parliament in this manner.PTI’s Omar Ayub accused the government of “bulldozing” the ordinances through the assembly and alleged that the language of these ordinances showed that there was ill intention behind this move.“These ordinances are meant to sell Pakistan. Take pictures of those members who are voting for it,” Mr Omar said as some PTI members tore apart the copies of the ordinances and flew them into the air. This prompted the speaker to issue a warning that he would take disciplinary action next time over such rowdyism.Responding to the criticism, Law Minister Tarar explained that there had been minor changes in the laws through these ordinances, which were aimed at reducing the government’s control of the boards of some public sector enterprises and making them autonomous.He said Prime Minister Shehbaz Sharif had already issued directives to form a committee comprising allies for legislative business.“Take pictures of those who are not faithful to the country, who want to destroy Pakistan’s economy and are writing letters to the IMF,” Mr Tarar said while responding to Mr Ayub’s remarks.Mr Tarar also questioned the legal status of the members sitting on the opposition benches after the Peshawar High Court’s decision to deny them the reserved seats on the quota of the Sunni Ittehad Council (SIC).“Stand behind the country and do not always stand behind a prisoner,” the law minister said in an apparent reference to jailed PTI leader Imran Khan.“You should engage in some soul-searching, as writing letters to the IMF and EU will not yield any positive results,” Mr Tarar said, defending the government’s move of tabling the ordinances.The ordinances laid before the assembly were the Pakistan Broadcasting Corporation (Amendment) Ordinance, 2023; the Pakistan National Shipping Corpo­ration (Amendment) Ordinance, 2023; the Pakistan Postal Services Management Board (Amendment) Ordinance, 2023; the National Highway Authority (Amendment) Ordinance, 2023; the Criminal Law (Amendment) Ordinance, 2023; the Privatisation Commission (Amen­dment) Ordinance, 2023; and the Establishment of Telecom­munication Appellate Tribunal Ordinance, 2023.Earlier, five women elected on the reserved seats from Khyber Pakhtunkhwa took the oath as MNAs. These lawmakers are Naima Kanwal, Asma Arbab Alamgir, Shaheen Shah, Ghazala Anjum and Naeema Kishwer.The National Assembly also unanimously passed a resolution “condemning” the ongoing Israeli aggression against the people of Palestine.The resolution was read out by PPP’s Shazia Marri. Interestingly, when the speaker put it for a voice vote, someone from the opposition benches shouted “No”. The speaker said that they had noted down the name of the member who had voted against the resolution that had been moved to express solidarity with the people of Palestine.Later, the speaker read out President Asif Zardari’s prorogation order and adjourned the inaugural session for an indefinite period.Dear visitor, the comments section is undergoing an overhaul and will return soon."},
{"title": "An angel in disguise: Zeba Masood doesn’t let an animal’s cry go unanswered", "url": "https://images.dawn.com/news/1192328/an-angel-in-disguise-zeba-masood-doesnt-let-an-animals-cry-go-unanswered", "text": "Away from the everyday hustle and bustle of big city life, in the quiet town of Charsadda, an elderly woman sits in the midst of hundreds of dogs. She pets all the broken animals that walk up to her, never running out of hugs and kisses to shower upon them.The dogs, mostly in plasters and bandages, look up to her with sparkling eyes, all of them vying for the perfect spot — her lap.“They are all my babies,” Zeba Masood said with a warm smile spread wide across her face.    An animal lover, she has been running Khyber Pakhtunkhwa’s first animal shelter, Lucky Animal Protection Shelter or LAPS, for the past six years without a single day off. The organisation not only provides shelter to stray animals but also finds them loving homes, a far cry from the lives of torture, hatred and pain they’ve had to endure.“The animals here were beaten to exhaustion; some of them had broken limbs, some were ruthlessly poisoned and left on the roads to die, some were starved to the extent where I found them nibbling on plastic and paper,” Masood recalled.“This is the story not of a single neighbourhood, but of every corner, every street.“The sight of these voiceless creatures, battered and abused, pains me in ways that are impossible to put into words,” she told , her voice laced with frustration and hurt.Living in Peshawar, for Masood, the sight of animals in pain was not a new one. Ultimately, that commonplace sight is what led to the creation of LAPS.She recalls that like most Pakistanis, her parents weren’t very interested in keeping pets at home. But they were kind enough to get her a dog, whom she named Vicky. He stuck with her right till the end, leaving behind his offspring to keep her company.Masood’s love for animals followed her to the United States, where she lived for nearly 40 years. “Even there, we would always bring strays home and take care of them. Not just me, but my children also feel the same way,” she told .The journey to the creation of LAPS began when she returned to Peshawar in 2017. “I came back due to my mother’s illness, but what deeply disturbed me was the cruelty [on display].”And so Masood began feeding dogs, cats, donkeys, horses and other strays. She found the perfect companion for these excursions in her husband. The couple would initially carry animal food in the trunk of their car and feed a pack of dogs in an empty plot owned by Masood’s father.    And then one day, she asked her father if she could fence in a small enclosure in the plot for her rescues. After hours of cajoling, LAPS was born.“The first animal I rescued was a pit bull, Lucky, and named our shelter after him,” she said.LAPS currently houses nearly 300 dogs. Masood and her small team have so far vaccinated over 5,000 stray animals and neutered more than 3,000 dogs and cats. They have an in-house vet for regular check-ups and call in specialised doctors for monthly visits.While the operations of the shelter are mostly self-funded, over the years, Masood has built a strong network of donors.However, running a shelter hasn’t been an easy job for Masood and her husband.“For some reason, people never got a hold as to why we were rescuing animals. Even my friends and family would often ask why I chose to open an animal shelter and not a non-profit organisation for ‘humans’.“They never understood that there are hundreds of NGOs to cater to women, orphans and others. But when it comes to animals, people hardly have anything to give, not sympathy not empathy…these animals can’t even speak for themselves or express the pain they feel,” she argued.There were days when Masood would wake up to the walls of her shelter chalked with obscenities. On other days, men would throw stones and bricks at the rescued animals, harming without a single reason. Some even tried to shoot her strays.“ [they are impure]” and “ [angels won’t come here]” are two of the refrains she heard every day.“One day,” she told , “a local  came to my house and grabbed my husband by the collar.” Fortunately, the police intervened in time but a few days later, the  rammed her door again and this time she was alone. The police were called again and while they forced the group to disperse, they could not root out the problem.“Instead, they told me to relocate and move to the quiet town of Charsadda,” Masood recalled. And so LAPS, with all its dogs and donkeys, travelled about 20.9 kilometres south of Peshawar, away from the hatred and curses.While her animals bring her immense happiness, witnessing the hatred directed at the furry-legged creatures over the past six years has taken a toll on Masood.There are days when she is plagued with self-doubt. “Am I doing enough?” she often asks herself.“As we speak, my team is trying to save a dog […] somebody is trying to shoot them and we are trying our best to rescue the animal,” Masood said. This is not the first time such an incident has occurred — she has seen far worse.“Because of the prevailing gun culture in the province, most of the cases we see are of animal shootings,” she highlighted.Over the last six years, Masood has seen teenagers throwing days-old kittens into gutters, people poisoning mother dogs and their newborn litters, and men beating donkeys to death.“Sometimes, we would rescue animals only to watch them die at LAPS because their condition is so,  bad and no matter how hard we try we just can’t save them,” she lamented.The 2022 floods, Masood recalled, were one of the most traumatic periods in her life. LAPS lost 15 dogs during the deluge, as up to seven feet of floodwater entered the shelter. “The smaller dogs we took home, but we had no other option but to leave the bigger ones on the roof of the shelter.”    When the situation grew too dangerous, she had to relocate the animals. But that was another challenge. “You cannot imagine the kind of harassment we faced, even from supposedly educated people…it was just pure heartache,” she said.While these experiences have left Masood deeply unsettled, they also showed her how important it is to keep moving forward and do more.LAPS, she said, spays and vaccinates at least five stray dogs and cats a week. “That is nothing, I would want to vaccinate at least 10 dogs a day, but unfortunately I don’t have the funds to do so.”Therefore, Masood is now trying to reach out to international donors, both for funds and help with adoption. She believes that vaccinating stray dogs and cats is extremely important, not just for the animals themselves but also to keep humans safe.She wants to create awareness, particularly among the younger generations. “We need to educate our kids to treat animals with compassion and be empathetic. Only when we do this will we be able to create a better society,” said Masood.She also wants to bring acceptance into society. This world, she said, is as much theirs as it is ours. The only way forward is coexistence.To illustrate her point, Masood quotes Mahatma Gandhi: “The greatness of a nation and its moral progress can be judged by the way its animals are treated.”"},
{"title": "Journalist Asad Toor released from Adiala Jail after Islamabad court approves bail", "url": "https://www.dawn.com/news/1821873/journalist-asad-toor-released-from-adiala-jail-after-islamabad-court-approves-bail", "text": "Journalist Asad Ali Toor was released from Adiala Jail on Saturday after an Islamabad trial court approved his bail in a case about an online campaign against the judiciary.In January, the car­e­taker government had  a joint investigation team (JIT) to probe an alleged social media campaign against the judiciary following the Supreme Court’s ruling that  PTI party of its bat symbol. This investigation led to Toor’s  of by Federal Investigation Agency (FIA) officials for nearly eight hours on February 23, despite previous assurances to the Supreme Court that no action would be taken against journalists before the general elections.Toor was later  on Feb 26 and faced charges under the Prevention of Electronic Crimes Act for allegedly launching a malicious campaign against state institutions, leading to his being remanded into custody and eventually to jail.As the case developed, the Islamabad High Court intervened,  an expedited bail hearing for Toor, which had been postponed to March 18 due to the investigating officer’s illness. This legal drama unfolded amid calls from the Committee to Protect Journalists (CPJ) for Toor’s immediate release and an end to his harassment, highlighting concerns over freedom of expression and the press in Pakistan.Special Judge Central Humayun Dilawar conducted the hearing of the case today. The petitioner, Toor, was represented by Advocates Imaan Mazari-Hazir and Hadi Ali Chatha.The investigation officer of the case and FIA prosecutor Ashfaq Hussain Shah were also present in court with the relevant case records.At the outset of the hearing, Advocate Chatha submitted the Supreme Court’s observation that journalists should  over a social media campaign against superior judges.At this, Judge Dilawar asked the investigation officer of the case and the FIA prosecutor if the Supreme Court’s observation being referred to was true. “Yes this observation is true,” the FIA official told the court.Subsequently, the court accepted Toor’s bail plea against surety bonds of Rs5,000. The journalist was later released.Advocate Hazir rejoiced at the development, saying their friend was once again among them.    Reacting to the development, journalist Hamid Mir stated that Toor’s bail approval proved that “all allegations were a pack of lies”.In a post on X, he said: “Judge Humayun Dilawar ordered the release of journalist Asad Toor today but what about those who registered a fake case against the journalist?“What about the 10-day physical remand given to FIA for the investigation? What about the anti-state allegations in the FIR? It is now proved that all allegations were a pack of lies.”    Barrister Ahsan J Pirzada lauded Toor’s counsel for the approval of Toor’s bail plea.“Alhumdullilah, 20 days after his arrest, Asad Ali Toor has been granted bail by the FIA court. Congrats to everyone, especially Imaan Hazir and Hadi Chatha. The way they both fought, despite numerous hurdles, is a testament to their courage, determination, professionalism and friendship,” he posted on X.    A day after Toor’s arrest, an Islamabad district and sessions court had  the FIA a five-day physical remand of the journalist. On March 6, the same lower court had  Toor’s physical remand for two days.According to the FIR (first information report), Toor was booked under Sections 9, 10 and 24 of the Prevention of Electronic Crimes Act (Peca), which deal with the offences of glorification of an offence, cyber terrorism and cyberstalking.The FIR stated that Toor “built a false narrative” and publically launched a “malicious/obnoxious and explicit campaign” against “civil servants/government officials and state institutions”.Dear visitor, the comments section is undergoing an overhaul and will return soon."},
{"title": "Turks up in arms over killing of stray cat", "url": "https://www.dawn.com/news/1821467/turks-up-in-arms-over-killing-of-stray-cat", "text": "The killing of a stray cat in Turkiye’s Istanbul has triggered petitions, protests and death threats, pushing the president to intervene and the courts to retry the culprit.On January 1, Ibrahim K was caught on a security camera in the lobby of the building where he lived kicking to death a stray cat named Eros that his neighbours regularly fed.He was sentenced in early February to 18 months in jail but was then released for good behaviour, sparking indignation among animal welfare groups and a section of the public in Turkey, whose large stray cat population is often fed and sheltered.Some 320,000 people signed an online petition demanding a stiffer sentence and in late February the justice ministry said Ibrahim K would be retried after it received a night-time call from President Recep Tayyip Erdogan saying he was taking a “personal” interest in the case.Ibrahim K was retried on Wednesday in a court building where hundreds of people thronged the corridors and the atmosphere was tense.The judges increased his sentence by one year but did not order him to be detained, ignoring the demands of animal welfare groups and internet trolls who have sent him death threats.One animal rights group is to appeal, saying Ibrahim K should be jailed for the maximum four years allowed by law.On Thursday, the hashtag  () was trending on X in Turkey and several major newspapers, including , splashed pictures of the dead cat on their front pages. carried several  about Eros and “Ibrahim the killer”.Several celebrities have joined the Justice for Eros appeal, including Argentinian footballer Mauro Icardi, the star striker at Istanbul giants and reigning Turkish champions Galatasaray.Dear visitor, the comments section is undergoing an overhaul and will return soon."}
]